## Terraform Plan for Production Environment

**Environment**: Production
**Workspace**: production
**Branch**: main
**Triggered by**: PR #130
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs[0].aws_ecs_service.blue will be updated in-place
  ~ resource "aws_ecs_service" "blue" {
        id                                 = "arn:aws:ecs:us-east-2:123324351829:service/production-ecs-cluster/production-blue-service"
        name                               = "production-blue-service"
        tags                               = {
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "production-blue-service"
            "Project"     = "tf-playground"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:123324351829:task-definition/production-blue-task:4" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs[0].aws_ecs_service.green will be updated in-place
  ~ resource "aws_ecs_service" "green" {
        id                                 = "arn:aws:ecs:us-east-2:123324351829:service/production-ecs-cluster/production-green-service"
        name                               = "production-green-service"
        tags                               = {
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "production-green-service"
            "Project"     = "tf-playground"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:123324351829:task-definition/production-green-task:4" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs[0].aws_ecs_task_definition.blue must be replaced
-/+ resource "aws_ecs_task_definition" "blue" {
      ~ arn                      = "arn:aws:ecs:us-east-2:123324351829:task-definition/production-blue-task:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:123324351829:task-definition/production-blue-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "production-blue-task" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "production-blue-task"
            "Project"     = "tf-playground"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs[0].aws_ecs_task_definition.green must be replaced
-/+ resource "aws_ecs_task_definition" "green" {
      ~ arn                      = "arn:aws:ecs:us-east-2:123324351829:task-definition/production-green-task:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:123324351829:task-definition/production-green-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "production-green-task" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "production-green-task"
            "Project"     = "tf-playground"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

  ```
  
  </details>